IdeaRS.OpenModel.Loading.LoadOnSurface
Load on surface

IdeaRS.OpenModel.Loading.LoadOnSurface.#ctor
Constructor

IdeaRS.OpenModel.Loading.LoadOnSurface.Fx
Force in X direction

IdeaRS.OpenModel.Loading.LoadOnSurface.Fy
Force in Y direction

IdeaRS.OpenModel.Loading.LoadOnSurface.Fz
Force in Z direction

IdeaRS.OpenModel.Loading.LoadOnSurface.Direction
Load direction LCS or GCS

IdeaRS.OpenModel.Loading.LoadOnSurface.Geometry
Gets, sets geometry of this LoadOnSurface